w8d1/reddit_clone/app/views/posts/show.html.erb

SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 4]]
---
<ul>
  <%= @post.subs.each do |sub| %>