w8d1/reddit_clone/app/controllers/posts_controller.rb

  def create

    @post = Post.new(title: post_params[:title], url: post_params[:url], content: post_params[:content], sub_id: post_params[:sub_id], author_id: current_user.id)
    if @post.save
---
INSERT INTO "post_subs" ("sub_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sub_id", 3], ["post_id", 4], ["created_at", "2021-03-08 23:20:36.203528"], ["updated_at", "2021-03-08 23:20:36.203528"]]
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"