w8d1/reddit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "abc"], ["description", "dddd"], ["moderator_id", 3], ["created_at", "2021-03-08 20:24:53.668856"], ["updated_at", "2021-03-08 20:24:53.668856"]]
---
  def create
    @sub = Sub.new(**sub_params, moderator_id: params[:id])

    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "sub.title1"], ["updated_at", "2021-03-08 22:06:53.674975"], ["id", 3]]
---
  def update
    @sub = Sub.find_by(id: params[:id])

    if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 1]]
---
  def destroy
    @sub = Sub.find_by(id: params[:id])

    @sub.destroy