w8d1/reddit_clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ojiLT+tLIf0XsqXroCeYhg=="], ["updated_at", "2021-03-08 18:23:03.024024"], ["id", 1]]
---
  def create
    @user = User.create(user_params)

    if @user.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    @user = self.current_user
    @user.delete