w11d4/benchBnb/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-03-31 19:53:05.168840"], ["session_token", "uHVHBqL1AROQpp4qu6LOXQ"], ["id", 17]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!