w11d4/benchBnb/app/controllers/application_controller.rb

  def current_user
    return nil unless session[:session_token]
    # @current_user ||= user.find_by_session_token(session[:session_token])
    @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "Bq8oGi9RSPv9BKpsH9R2nQ"], ["LIMIT", 1]]