w7d2/music_app/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "123456"], ["LIMIT", 1]]
---
  def find_user_by_credentials(email, password)

    if User.find_by(email: email)