w7d2/music_app/app/controllers/users_controller.rb

  def create

    @user = User.new(user_params)
    @user.password=(params[:user][:password])
    @user.password_digest = create_password(params[:user][:password])
    @user.session_token = login!

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"