toy_store/app/controllers/toys_controller.rb

  def index
    if params["category_id"]
      @toys = Toy.where(category_id: params["category_id"])
    else
      @toys = Toy.all
---
SELECT "toys".* FROM "toys" WHERE "toys"."category_id" = $1  [["category_id", 1]]
SELECT "toys".* FROM "toys" WHERE (category = 1)