w6d5/cats/app/controllers/cats_controller.rb

   def create
      @cat = Cat.new(cat_params)

      if @cat
         @cat.save!
---
INSERT INTO "cats" ("birth_date", "name", "created_at", "updated_at", "description", "sex", "color") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"